[
  "If you replace 'W' with 'T' in What, Where, and When, you get That, There, and Then.",
  "The word 'bed' looks like a bed.",
  "Your future self is watching you right now through memories.",
  "We accept the love we think we deserve, but we also accept the WiFi password we think we deserve.",
  "If you're waiting for the waiter, aren't you the waiter?",
  "The brain named itself.",
  "You've never seen your own face, only reflections and pictures.",
  "Every photo of you is from when you were younger.",
  "The word 'queue' is just the letter Q followed by four silent letters.",
  "If you clean a vacuum cleaner, you become a vacuum cleaner.",
  "The first person to milk a cow was probably very thirsty and very brave.",
  "We say 'after dark' when it's actually after light.",
  "Your age is the number of times you've orbited the sun.",
  "The word 'short' is longer than the word 'long'.",
  "If you're over 30, you were alive before every dog on Earth was born.",
    "Technically, when you say 'forward' or 'backward', your lips move in that direction.",
    "Your belly button is just your old mouth.",
    "Clapping is just hitting yourself because you like something.",
    "We’re all just unpaid actors in everyone else’s story.",
    "‘Goose bumps’ are just braille for scary stories.",
    "Your shadow is proof the sun has a crush on you but doesn’t know how to approach.",
    "Every mirror you buy is second-hand.",
    "At some point, your mom put you down and never picked you up again.",
    "Your stomach thinks all potatoes are mashed.",
    "The word 'swims' is 'swims' upside down.",
    "Your hands have touched things your face never will.",
    "Technically, we live in the past because of how long it takes our brain to process reality.",
    "When you drink water, you’re sipping on dinosaur pee molecules.",
    "When you ask for 'extra ice', you’re literally paying for less drink.",
    "The 's' in 'lisp' makes the word itself cruel.",
    "Sleep is a free trial of death.",
    "Dogs probably think humans invented walking on leashes for fun.",
    "Cemeteries are basically haunted parking lots.",
    "When you 'bite down' you’re actually biting up.",
    "Your first birthday is technically your second birthday.",
    "The word 'silent' and 'listen' are spelled with the same letters.",
    "You only have two minutes to live, but every time you breathe you reset the timer.",
    "Brushing your teeth is the only time you clean your skeleton.",
    "A 'fat chance' and a 'slim chance' mean the same thing.",
    "Your tongue knows how everything you look at would feel to lick.",
    "Babies are the only humans who are legally allowed to sleep at work.",
    "‘Reading’ is just staring at a piece of dead tree while hallucinating.",
    "If you’re average, then half the world is uglier than you.",
    "You’ve never actually felt anything with your fingers; your brain is just interpreting signals.",
    "Mosquitoes are basically dirty flying needles that inject strangers.",
    "History classes are just humanity’s gossip sessions.",
    "Your pillow has seen more of your tears than most of your friends.",
    "We’re all just skeletons wearing meat costumes.",
    "Technically, you’re older than the Internet browser you’re using right now.",
    "If you cut a sandwich in half, you just created two smaller sandwiches.",
    "Car horns are basically car screams.",
    "You have never actually experienced silence, only the absence of noise.",
    "Your bed is a charging station for humans.",
    "The person who invented the alarm clock literally hated people being happy.",
    "Being 'up all night' and 'down all day' means the same thing.",
    "Your stomach thinks every potato is mashed potato.",
    "Every broken clock is right twice a day.",
    "The word 'none' is a number.",
    "When you throw trash away, you’re just moving it somewhere else.",
    "Technically, our whole planet is a 'carry-on luggage' in space.",
    "When you say 'I slept like a baby', you’re actually saying you woke up crying every two hours.",
    "We’re always looking at stars from the past.",
    "Someone had to be the first person to eat an egg that came out of a chicken’s butt.",
    "Your lips never actually touch when you say the word 'touch'.",
    "The word 'monosyllabic' is not monosyllabic.",
    "Technically, the brain named itself and congratulates itself for it.",
    "Blinking is just giving your eyes a mini nap.",
    "Rain is sky sweat.",
    "Technically, the floor is just a big shelf that holds everything.",
    "An escalator is never really broken. It’s just stairs.",
    "Everything you see is technically in the past.",
    "Your pet doesn’t know what you look like naked, but your vet does.",
    "You can’t stand backwards on stairs.",
    "A group of people sitting silently on their phones looks like a WiFi loading screen.",
    "Your hair is technically dead, and you style it every morning like a corpse fashion show.",
    "When you say 'forward' your lips move forward, when you say 'backward' they move backward.",
    "Your reflection has seen you at your worst and never judged you.",
    "Salt is the only rock we eat.",
    "The brain can’t feel pain, but it creates all the pain.",
    "We live in houses made of dead trees, decorated with dead plants, while burning dead dinosaurs.",
    "Your whole body is just a complicated cage carrying your brain around.",
    "Languages are just agreed-upon noises.",
    "A 'wise man' and a 'wise guy' are opposites.",
    "When you smell something, tiny particles of it are inside your nose.",
    "Technically, we all have skeletons inside of us trying to get out.",
    "Your voice is just the sound your breath makes while escaping your body.",
    "Dreams are free movies your brain directs every night.",
    "You’ll never know what it feels like to die, only what it feels like to almost die.",
    "The word 'bookkeeper' has three consecutive double letters.",
    "Our fingerprints don’t get wet; the skin around them does.",
    "There are more fake flamingos in the world than real ones.",
    "Your phone is the most loyal stalker you’ll ever have.",
    "When you shake someone’s hand, you’re basically holding their skeleton.",
    "Somewhere in the world, your 'future ex' is walking around.",
    "When you delete something, it just becomes invisible, not gone.",
    "A minute of pain feels longer than a minute of joy.",
    "The word 'wrong' is spelled 'wrong' in the dictionary.",
    "Technically, you can never touch anything because atoms repel each other.",
    "Your dreams are basically brain fanfiction.",
    "If Pinocchio said 'My nose will grow now', the universe might explode.",
    "We’re all just ghosts driving a skeleton wrapped in meat.",
    "Gravity is just Earth hugging you aggressively.",
    "When you wake up, your bed misses you.",
    "If you’re clean, the soap is dirty.",
    "Your blood is always wet, but you’ve never seen it dry naturally on the inside.",
    "Your phone battery dies faster when you need it the most because it’s dramatic.",
    "Money is just paper with confidence issues.",
    "Maps are flat Earths everyone agrees on.",
    "When you look at the moon, you’re actually seeing old light that left seconds ago.",
    "Every mirror is technically a portal to another world where you copy yourself.",
    "Fire is the only thing we can’t touch without being destroyed.",
    "You’re both the oldest you’ve ever been and the youngest you’ll ever be.",
    "Technically, you’ve never been in the same room as anyone else—just really close air particles.",
    "We’re basically WiFi signals made out of meat."
  ]
  